// task_number_two.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using std::cin;
using std::cout;
using std::endl;
int main()
{
    int upper_side_of_the_trapezoid;
    int upper_side_of_the_trapezoid;
    int hight_of_the_trapezoid;
    setlocale(LC_ALL, "Russian");
    cout << ("Введите верхнюю, нижнюю стороны и высоту") << endl;
    cin >> upper_side_of_the_trapezoid;
    cin >> upper_side_of_the_trapezoid;
    cin >> hight_of_the_trapezoid;
    int area = (upper_side_of_the_trapezoid + upper_side_of_the_trapezoid) / 2 * hight_of_the_trapezoid;
    cout << area;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
